sobczyk/bsp/csps/lpc32xx/source/lpc32xx_i2c_driver.c
  device = ((I2C_CFG_T *) devid);
  setup  = (I2C_MRX_SETUP_T*)(device->txrx_setup);

  /* were there Arbitration or ACK problems? */
  if ((device->regptr->i2c_stat & (I2C_NAI | I2C_AFI)) != 0)
  {
    if (setup->retransmissions_count != setup->retransmissions_max)
    {
      /* update status */
      setup->retransmissions_count++;
      setup->status = setup->retransmissions_count;
      /* clear Arbitration and Transaction Done interrupt flags */
      device->regptr->i2c_stat = I2C_AFI | I2C_TDI;
      /* clear received byte counter */
      setup->rx_count = 0;
      /* set transmitted byte counter */
      setup->tx_count = 1;
      /* soft reset */
      device->regptr->i2c_ctrl = I2C_RESET;
      /* restore 10-bit addr option if needed */
      if (device->ip_setup->addr_mode == ADDR10BIT)
      {
        device->regptr->i2c_ctrl = I2C_SEVEN;
      }
      /* load slave address */
      load_slave_address(devid, setup->addr_mode, 
                         setup->sl_addr, I2C_M_WRITE);
      /* en RxD Av,RxFIFO Fl,M Tx DataR,Tx noACK,Tx ArbF,Tx Done Ints */
      /* write a dummy byte to trigger actual data transfer */
	if (  setup->rx_length == setup->tx_count )
	{
	  /* if receive one byte only, send STOP along with dummy byte. */ 
	  device->regptr->i2c_txrx = I2C_STOP | 0xAA;
	}
	else
	{
	  device->regptr->i2c_txrx = 0xAA;
	}
      device->regptr->i2c_ctrl = (device->regptr->i2c_ctrl & I2C_SEVEN)|
                                 I2C_RFDAIE | I2C_RFFIE | I2C_DRMIE | 
                                 I2C_NAIE | I2C_AFIE | I2C_TDIE;
    }
    else
    {
      /* update status */
      setup->status |= 
          ((device->regptr->i2c_stat & ((I2C_AFI | I2C_NAI)) << 8) |
           I2C_SETUP_STATUS_DONE);
      /* Disable I2C interrupt in the interrupt controller */
      disable_i2c_irq_int(devid);
    }
  }
  /* was a STOP generated? */
  else if ((device->regptr->i2c_stat & I2C_TDI) != 0)
  {
    /* clear the TDI bit */
    device->regptr->i2c_stat |= I2C_TDI;
    /* update status */
    setup->status |= I2C_SETUP_STATUS_DONE;
    /* Disable I2C interrupt in the interrupt controller */
    disable_i2c_irq_int(devid);
  }
  /* read more data */
  else
  {
    length  = setup->rx_length;
    count   = setup->rx_count;
    while ((length != count) && 
           ((device->regptr->i2c_stat & I2C_RFE) == 0))
    {
      (setup->rx_data)[count] = device->regptr->i2c_txrx;
      count++;
    }
    setup->rx_count = count;
    /* have all data been received? */
    if (count == length)
    {
      /* enable Tx no ACK, Tx Arbitr Fail, Tx Done Ints */
      device->regptr->i2c_ctrl = (device->regptr->i2c_ctrl & I2C_SEVEN)| 
                                 I2C_NAIE | I2C_AFIE | I2C_TDIE;
    }
    else
    {
      // not all data received, fill the Tx FIFO with more dummies
      while ((setup->tx_count != length) && 
             ((device->regptr->i2c_stat & I2C_TFF) == 0))
      {
        if (((setup->tx_count) + 1) == length)
        {
          device->regptr->i2c_txrx = I2C_STOP | 0xAA;
        }
        else
        {
          device->regptr->i2c_txrx = 0xAA;
        }
        setup->tx_count++;
      }
    }
  }
  return;
}

/***********************************************************************
 * I2C master transmitter followed by master receiver interrupt handler
 **********************************************************************/
void i2c_mtxrx_handler(INT_32 devid)
{
  UNS_32 length, count;
  I2C_CFG_T * device;
  I2C_MTXRX_SETUP_T * setup;
  static UNS_32 txrx_state = 0;

  device = ((I2C_CFG_T *) devid);
  setup  = (I2C_MTXRX_SETUP_T*)(device->txrx_setup);

  /* were there Arbitration or ACK problems? */
  if ((device->regptr->i2c_stat & (I2C_NAI | I2C_AFI)) != 0)
  {
    if (setup->retransmissions_count != setup->retransmissions_max)
    {
      /* update status */
      setup->retransmissions_count++;
      setup->status = setup->retransmissions_count;
      /* clear Arbitration and Transaction Done interrupt flags */
      device->regptr->i2c_stat = I2C_AFI | I2C_TDI;
      /* clear transmitted & received byte counter */
      setup->tx_count = 0;
      setup->rx_count = 0;
	  /* set the state indicator */
	  txrx_state = 0;
      /* soft reset */
      device->regptr->i2c_ctrl = I2C_RESET;
      /* restore 10-bit addr option if needed */
      if (device->ip_setup->addr_mode == ADDR10BIT)
      {
        device->regptr->i2c_ctrl = I2C_SEVEN;
      }
      /* load slave address */
      load_slave_address(devid, setup->addr_mode, 
                         setup->sl_addr, I2C_M_WRITE);
      /* en TxFIFO not full,M TxDataR,Tx noACK,Tx ArbF,Tx Done Ints */
      device->regptr->i2c_ctrl = 
          (device->regptr->i2c_ctrl & I2C_SEVEN) | I2C_TFFIE | 
          I2C_DRMIE | I2C_NAIE | I2C_AFIE | I2C_TDIE;
    }
    else
    {
      /* update status */
      setup->status |= 
          ((device->regptr->i2c_stat & ((I2C_AFI | I2C_NAI)) << 8) |
          I2C_SETUP_STATUS_DONE);
      /* Disable I2C interrupt in the interrupt controller */
      disable_i2c_irq_int(devid);
      /* set txrx state for a new transfer */
      txrx_state = 0;
    }
  }
  /* was a STOP generated? */
  else if ((device->regptr->i2c_stat & I2C_TDI) != 0)
  {
    /* clear the TDI bit */
    device->regptr->i2c_stat |= I2C_TDI;
    /* update status */
    setup->status |= I2C_SETUP_STATUS_DONE;
    /* Disable I2C interrupt in the interrupt controller */
    disable_i2c_irq_int(devid);
    /* set txrx state for a new transfer */
    txrx_state = 0;
  }
  /* transfer triggered interrupt */
  else
  {
    switch (txrx_state)
	{
	  /* transmitting data */
	  case 0:
        length  = setup->tx_length;
        count   = setup->tx_count;
        while ((length != count) && 
               ((device->regptr->i2c_stat & I2C_TFF) == 0))
        {
          device->regptr->i2c_txrx = (setup->tx_data)[count];
          count++;
        }
        setup->tx_count = count;
        /* have all data been sent? */
        if (count == length)
        {
		  /* switch to receiving data */
		  txrx_state = 1; 
		  setup->tx_count = 0;
          /* en M Tx Data Req, Tx no ACK, Tx Arb Fail, Tx Done Ints */
          device->regptr->i2c_ctrl = 
              (device->regptr->i2c_ctrl & I2C_SEVEN) | I2C_DRMIE | 
              I2C_NAIE | I2C_AFIE | I2C_TDIE;
        }
	    break;
	  /* receiving data */
	  default:
        /* is repeated START + slave address + READ needed? */
        if (setup->tx_count == 0)
        {
          if (setup->addr_mode ==ADDR7BIT)
          {
            device->regptr->i2c_txrx = 
                I2C_START | (setup->sl_addr << 1) | I2C_M_READ;
          }
          else
          {
            device->regptr->i2c_txrx = I2C_START | 0xF0 | 
                ((setup->sl_addr & 0x30)>>7) | I2C_M_READ;
          }
          /* en RxDt Av,RxFIFO Fl,MTx DtR,Tx noACK,Tx ArbF,TxDn Ints */
          device->regptr->i2c_ctrl = 
              (device->regptr->i2c_ctrl & I2C_SEVEN) | I2C_RFDAIE | 
              I2C_RFFIE | I2C_DRMIE | I2C_NAIE | I2C_AFIE | I2C_TDIE;
          /* write a dummy byte to trigger actual data transfer */
		  setup->tx_count = 1;
		  setup->rx_count = 0;
		  if ( setup->rx_length == setup->tx_count )
		  {
			/* if receive one byte only, send STOP along with dummy byte. */ 
			device->regptr->i2c_txrx = I2C_STOP | 0xAA;
		  }
		  else
		  {
			device->regptr->i2c_txrx = 0xAA;
		  }
		}
		else
		{
          length  = setup->rx_length;
          count   = setup->rx_count;
          while ((length != count) && 
                 ((device->regptr->i2c_stat & I2C_RFE) == 0))
          {
            (setup->rx_data)[count] = device->regptr->i2c_txrx;
            count++;
          }
          setup->rx_count = count;
          /* have all data been received? */
          if (count == length)
          {
            /* enable Tx no ACK, Tx Arbitr Fail, Tx Done Ints */
            device->regptr->i2c_ctrl = 
                (device->regptr->i2c_ctrl & I2C_SEVEN) | I2C_NAIE | 
                I2C_AFIE | I2C_TDIE;
          }
          else
          {
            // not all data received, fill the Tx FIFO with more dummies
            while ((setup->tx_count != length) && 
                   ((device->regptr->i2c_stat & I2C_TFF) == 0))
            {
              if (((setup->tx_count) + 1) == length)
              {
                device->regptr->i2c_txrx = I2C_STOP | 0xAA;
              }
              else
              {
                device->regptr->i2c_txrx = 0xAA;
              }
              setup->tx_count++;
            }
          }
		}
	    break;
	}
  }
  return;
}

/***********************************************************************
 * I2C slave transmitter interrupt handler
 **********************************************************************/
void i2c_stx_handler(INT_32 devid)
{
  UNS_32 length, count;
  I2C_CFG_T * device;
  I2C_STX_SETUP_T * setup;

